app/views/user/show.html.erb

  <div class = "d-inline-flex flex-wrap justify-content-around align-self-stretch">
  <%evenement_organised = Evenement.where(admin_id: @user.id)%>
---
SELECT "evenements".* FROM "evenements" WHERE "evenements"."admin_id" = $1  [["admin_id", 3]]