app/controllers/events_controller.rb

SELECT "evenements".* FROM "evenements"
---
  def index
    @evenement = Evenement.all

SELECT "evenements".* FROM "evenements" WHERE "evenements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "evenements".* FROM "evenements" LIMIT $1  [["LIMIT", 11]]
---
  def show
    # Méthodeui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    received_id = params[:id]
    @evenement = Evenement.find_by(id: params[:id])
    @evenement_title = @evenement.title
    @evenement_description = @evenement.description
    @start_date = @evenement.start_date
    @duration = @evenement.duration
    @location = @evenement.location
    @price = @evenement.price
    @admin = @evenement.admin.first_name

INSERT INTO "evenements" ("start_date", "duration", "title", "description", "price", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
    @title= params[:title]
    @duration = params[:duration]
    @start_date = DateTime.now +params[:start_date].to_i
    @location = params[:location]
    @price= params[:price]
    @description = params[:description]
    @user= current_user.id
    @evenement = Evenement.new(title: @title, start_date:@start_date, duration:@duration, location: @location, price:@price , description: @description, admin_id: @user)

      if @evenement.save