app/controllers/user_controller.rb

  def show
    received_id = params[:id]
    @user = User.find(received_id)
    @user_first_name = @user.first_name
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]